// ---------------------------------------------------------------------------------------------------------------------------
//Моё решение!!!!!!!!!!!!!!!!!!!!!!!!!
String.prototype.isUpperCase = function() {
	return this == this.toUpperCase() ? true : false;
};

// ---------------------------------------------------------------------------------------------------------------------------
//Лучшее решение!!!!!!!!!!!!!!!!!!!!!!!!!
// String.prototype.isUpperCase=function() {return this==this.toUpperCase()}