// ---------------------------------------------------------------------------------------------------------------------------
//Моё решение!!!!!!!!!!!!!!!!!!!!!!!!!
function getNumberFromString(s) {
	var result = "";

	for (var i = 0; i < s.length; i++) {

		if (parseInt(s[i])) {
			result = result + s[i];
		} else if(s[i] == "0") {
			result = result + s[i];
		}
	}

	return parseInt(result);
}

// ---------------------------------------------------------------------------------------------------------------------------
//Лучшее решение!!!!!!!!!!!!!!!!!!!!!!!!!
// function getNumberFromString(s) {
//   return +s.replace(/\D/g, "");
// }
