// ---------------------------------------------------------------------------------------------------------------------------
//Моё решение!!!!!!!!!!!!!!!!!!!!!!!!!
function evil(n) {
	var result = "";
    n = n.toString(2);

    for (var i = 0; i < n.length; i++) {
    	if (n[i] == 1) {
    		result = result + n[i];
    	}
    }

	return result.length % 2 === 0 ? "It's Evil!" : "It's Odious!";
}

// ---------------------------------------------------------------------------------------------------------------------------
//Лучшее решение!!!!!!!!!!!!!!!!!!!!!!!!!
// evil = n => ["It's Evil!", "It's Odious!"][(n.toString(2).split("1").length-1) & 1]; //не понятная какая то :(